# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 20  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# 0-P1/2
# 1-P2/4
# 2-P3/8
# 3-P4/16
# 4-P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, fasternet_t0, [weights/fasternet_t0-epoch.281-val_acc1.71.9180.pth]], # 4
   [-1, 1, SPPF, [1024, 5]],  # 5
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 6
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 7
   [[-1, 3], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 9

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, CoordAttention, [256]],  # 13-CoordAttention*
   [-1, 3, C3, [256, False]],  # 13 (P3/8-small) *-> 14

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P4
   [-1, 1, CoordAttention, [512]],  # 17-CoordAttention*
   [-1, 3, C3, [512, False]],  # 16 (P4/16-medium) **-> 18

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 5], 1, Concat, [1]],  # cat head P5
   [-1, 1, CoordAttention, [1024]],  # 21-CoordAttention*
   [-1, 3, C3, [1024, False]],  # 19 (P5/32-large) ***-> 22

   [[14, 18, 22], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]