# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 20  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone - MobileNetV2
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2]],  # 0-P1/2  320x320x32
   [-1, 1, InvertedResidual, [32, 1, 1]],  # 1         320x320*16
   [-1, 1, InvertedResidual, [48, 2, 6]],  # 2-P2/4    160x160*24
   [-1, 1, InvertedResidual, [48, 1, 6]],
   [-1, 1, InvertedResidual, [64, 2, 6]],  # 4-P3/8    80x80*32
   [-1, 1, InvertedResidual, [64, 1, 6]],
   [-1, 1, InvertedResidual, [64, 1, 6]],
   [-1, 1, InvertedResidual, [128, 2, 6]],  # 7-P4/16  40x40*64
   [-1, 1, InvertedResidual, [128, 1, 6]],
   [-1, 1, InvertedResidual, [128, 1, 6]],
   [-1, 1, InvertedResidual, [128, 1, 6]],
   [-1, 1, InvertedResidual, [192, 1, 6]],  # 11       40x40*96
   [-1, 1, InvertedResidual, [192, 1, 6]],
   [-1, 1, InvertedResidual, [192, 1, 6]],
   [-1, 1, InvertedResidual, [320, 2, 6]],  # 14-P5/32 20x20*160
   [-1, 1, InvertedResidual, [320, 1, 6]],
   [-1, 1, InvertedResidual, [320, 1, 6]],
   [-1, 1, InvertedResidual, [640, 1, 6]],  # 17       20x20*320
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                    # 20x20*320 -> 20x20*512
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 20x20*512 -> 40x40*512
   [[-1, 13], 1, Concat, [1]],  # cat backbone P4 # 40x40*512 + 40x40*64 -> 40x40*576
   [-1, 1, C3, [512, False]],  # 13 -> 21         # 40x40*576  -->  40x40*512

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat back bone P3
   [-1, 1, C3, [256, False]],  # 17 (P3/8-small) -> 25

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 22], 1, Concat, [1]],  # cathead P4
   [-1, 1, C3, [512, False]],  # 20 (P4/16-medium) -> 28

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 18], 1, Concat, [1]],  # cathead P5
   [-1, 1, C3, [1024, False]],  # 23 (P5/32-large) -> 31

   [[25, 28, 31], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]


