# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 20  # number of classes
depth_multiple: 1.0  # model depth multiple, don't change this otherwise InvertedResidual will be affected
width_multiple: 1.0  # layer channel multiple don't change this otherwise InvertedResidual will be affected
# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # ShuffleBlock: [out, stride]
  # [from, number, module, args]
  [[-1, 1, ConvBNReLuMaxpool, [ 32 ] ], # 0-P2/4
   [-1, 1, ShuffleBlock, [128, 2]],  # 1-P3/8
   [-1, 3, ShuffleBlock, [128, 1]],  # 2
   [-1, 1, ShuffleBlock, [256, 2]],  # 3-P4/16
   [-1, 7, ShuffleBlock, [256, 1]],  # 4
   [-1, 1, ShuffleBlock, [512, 2]],  # 5-P5/32
   [-1, 3, ShuffleBlock, [512, 1]],  # 6
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, C3, [256, False]],  # 13 -> 10

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, C3, [128, False]],  # 17 (P3/8-small) -> 14

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 11], 1, Concat, [1]],  # cat head P4
   [-1, 1, C3, [256, False]],  # 20 (P4/16-medium) -> 17

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 7], 1, Concat, [1]],  # cat head P5
   [-1, 1, C3, [512, False]],  # 23 (P5/32-large) -> 20

   [[14, 17, 20], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]

